In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('/Users/B0264653/Desktop/Namaste-Python/Day8/orders.txt')
df.head()

,order_id,order_date,customer_name,city,category,product_id,sales,profit
0,CA-2018-100006,2018-09-07,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113
1,CA-2018-100090,2018-07-08,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354
2,CA-2018-100293,2018-03-14,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696
3,CA-2018-100328,2018-01-28,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257
4,CA-2018-100363,2018-04-08,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288

In [14]:
df.columns

Index(['order_id', 'order_date', 'customer_name', 'city', 'category',
       'product_id', 'sales', 'profit'],
      dtype='object')

In [5]:
df['sales'].sum()

1107592.9048

In [6]:
df['sales'].mean()

221.12056394489917

In [7]:
df['sales'].max()

10499.97

In [8]:
fc= df['category']=='Furniture'  # category==Furniture
df[fc]['sales'].sum()

628359.3048

In [9]:
fc1 = df['category']=='Technology'
df[fc1]['sales'].sum()

180636.84800000003

In [26]:
 df.groupby('category')['sales'].sum() #groupby category get sales and #datatype is series

category
Furniture          628359.3048
Office Supplies    298596.7520
Technology         180636.8480
Name: sales, dtype: float64

In [25]:
df_cat_sales= df.groupby('category')['sales'].sum() #groupby category get sales and #datatype is series

In [24]:
df_cat_sales.values

array([628359.3048, 298596.752 , 180636.848 ])

In [27]:
pd.DataFrame({'category':df_cat_sales.index,'sales':df_cat_sales.values}) #converted series to dataframe

          category        sales
0        Furniture  628359.3048
1  Office Supplies  298596.7520
2       Technology  180636.8480

In [29]:
#groupby on two columns
df.groupby(['category','city'])['sales'].sum()

category    city
Furniture   Akron          433.5960
            Alexandria     204.6400
            Allen          244.0060
            Allentown       11.6480
            Amarillo      3048.5828
                            ...
Technology  Wichita        224.7500
            Wilmington     694.3560
            Woodland       239.9840
            Yonkers        216.4000
            Yuma           785.5130
Name: sales, Length: 987, dtype: float64

In [30]:
df.head()

,order_id,order_date,customer_name,city,category,product_id,sales,profit
0,CA-2018-100006,2018-09-07,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113
1,CA-2018-100090,2018-07-08,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354
2,CA-2018-100293,2018-03-14,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696
3,CA-2018-100328,2018-01-28,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257
4,CA-2018-100363,2018-04-08,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288

In [33]:
df.groupby('category', as_index=False).agg({'sales':'sum','profit':'sum','profit':'min'})

          category        sales     profit
0        Furniture  628359.3048 -1862.3124
1  Office Supplies  298596.7520 -2929.4845
2       Technology  180636.8480  -571.9956

In [35]:
#merge or join
dfr = pd.read_csv('/Users/B0264653/Desktop/Namaste-Python/Day10/returns.txt')
dfr

           order_id Return Reason
0    CA-2020-104689   Wrong Items
1    CA-2020-105081   Wrong Items
2    CA-2020-105291   Wrong Items
3    CA-2020-105585   Wrong Items
4    CA-2020-106950   Wrong Items
..              ...           ...
291  US-2021-136679        Others
292  US-2021-147886        Others
293  US-2021-147998   Wrong Items
294  US-2021-151127   Wrong Items
295  US-2021-155999   Wrong Items

[296 rows x 2 columns]

In [38]:
dfo = pd.DataFrame(df)

In [39]:
dfo

,order_id,order_date,customer_name,city,category,product_id,sales,profit
0,CA-2018-100006,2018-09-07,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113
1,CA-2018-100090,2018-07-08,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354
2,CA-2018-100293,2018-03-14,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696
3,CA-2018-100328,2018-01-28,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257
4,CA-2018-100363,2018-04-08,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288
...,...,...,...,...,...,...,...,...
5004,US-2021-168802,2021-11-03,Jack O'Briant,Seattle,Office Supplies,OFF-BI-10002393,18.368,5.9696
5005,US-2021-169320,2021-07-23,Lena Hernandez,Elkhart,Office Supplies,OFF-AR-10003602,11.680,5.4896
5006,US-2021-169488,2021-09-07,Allen Armold,Providence,Office Supplies,OFF-PA-10000157,39.960,18.7812
5007,US-2021-169502,2021-08-28,Matthew Grinstein,Milwaukee,Office Supplies,OFF-AP-10001947,91.600,26.5640
5008,US-2021-169551,2021-07-07,Rob Lucas,Philadelphia,Furniture,FUR-BO-10001519,87.210,-45.3492

In [43]:
#merge/join
pd.merge(left = dfo, right = dfr, left_on='order_id', right_on='order_id', how='inner')
pd.merge(left = dfo, right = dfr, left_on='order_id', right_on='order_id', how='left')
pd.merge(left = dfo, right = dfr, left_on='order_id', right_on='order_id', how='right')
pd.merge(left = dfo, right = dfr, left_on='order_id', right_on='order_id', how='outer')

,order_id,order_date,customer_name,city,category,product_id,sales,profit,Return Reason
0,CA-2018-100006,2018-09-07,Dennis Kane,New York City,Technology,TEC-PH-10002075,377.970,109.6113,NaN
1,CA-2018-100090,2018-07-08,Ed Braxton,San Francisco,Furniture,FUR-TA-10003715,502.488,-87.9354,NaN
2,CA-2018-100293,2018-03-14,Neil Französisch,Jacksonville,Office Supplies,OFF-PA-10000176,91.056,31.8696,NaN
3,CA-2018-100328,2018-01-28,Jasper Cacioppo,New York City,Office Supplies,OFF-BI-10000343,3.928,1.3257,NaN
4,CA-2018-100363,2018-04-08,Jim Mitchum,Glendale,Office Supplies,OFF-FA-10000611,2.368,0.8288,NaN
...,...,...,...,...,...,...,...,...,...
5004,US-2021-168802,2021-11-03,Jack O'Briant,Seattle,Office Supplies,OFF-BI-10002393,18.368,5.9696,NaN
5005,US-2021-169320,2021-07-23,Lena Hernandez,Elkhart,Office Supplies,OFF-AR-10003602,11.680,5.4896,NaN
5006,US-2021-169488,2021-09-07,Allen Armold,Providence,Office Supplies,OFF-PA-10000157,39.960,18.7812,NaN
5007,US-2021-169502,2021-08-28,Matthew Grinstein,Milwaukee,Office Supplies,OFF-AP-10001947,91.600,26.5640,NaN
5008,US-2021-169551,2021-07-07,Rob Lucas,Philadelphia,Furniture,FUR-BO-10001519,87.210,-45.3492,NaN

In [59]:
# create dataset

import pandas as pd
emp1 = {"name":["Ankit1","Ankit1","Rahul1","Priya1"],"gender":["Male1","Male1","Male1","Female1"],"email":["ankit@gmail.com1","ankit@gmail.com1","rahul@gmail.com1","priya@gmail.com1"]}
df1 = pd.DataFrame(emp1)

emp2 = {"name":["Ankit2","Ankit2","Rahul2"],"gender":["Male2","Male2","Male2"],"email":["ankit@gmail.com2","ankit@gmail.com2","rahul@gmail.com"]}
df2 = pd.DataFrame(emp2)

In [60]:
##UNION /APPENDING 2 DATAFRAMES
#combine based on columns
df = pd.concat([df1,df2], ignore_index = True,axis=0)

#combine based on rows
# pd.concat([df1,df2], ignore_index = True,axis=1)

In [62]:
df

     name   gender             email
0  Ankit1    Male1  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1  priya@gmail.com1
4  Ankit2    Male2  ankit@gmail.com2
5  Ankit2    Male2  ankit@gmail.com2
6  Rahul2    Male2   rahul@gmail.com

In [71]:
#drop duplicates
#keep = (last and first two values)
#inplace = True ( to make permanent changes)
df.drop_duplicates('email',keep='first')

     name   gender             email
0  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1  priya@gmail.com1
4  Ankit2    Male2  ankit@gmail.com2
6  Rahul2    Male2   rahul@gmail.com

In [72]:
df.drop_duplicates(['email','gender'],keep='first')

     name   gender             email
0  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1  priya@gmail.com1
4  Ankit2    Male2  ankit@gmail.com2
6  Rahul2    Male2   rahul@gmail.com

In [73]:
df.drop_duplicates(['email','gender'],keep=False) # do not wnat to keep both duplicate then

     name   gender             email
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1  priya@gmail.com1
6  Rahul2    Male2   rahul@gmail.com

In [81]:
df.groupby('email')['name'].count()

email
ankit@gmail.com1    2
ankit@gmail.com2    2
priya@gmail.com1    1
rahul@gmail.com     1
rahul@gmail.com1    1
Name: name, dtype: int64

In [79]:
df.groupby('email')['name'].count().index # get index
df.groupby('email')['name'].count().values #get values

array([2, 2, 1, 1, 1])

In [82]:
import numpy as np
import pandas as pd
emp = {"name":["Ankit1","Ankit1","Rahul1","Priya1"],"gender":[np.nan,"Male1","Male1","Female1"],"email":["ankit@gmail.com1","ankit@gmail.com1","rahul@gmail.com1",np.nan]}
df = pd.DataFrame(emp)

In [83]:
df

     name   gender             email
0  Ankit1      NaN  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1               NaN

In [84]:
df.isna()

    name  gender  email
0  False    True  False
1  False   False  False
2  False   False  False
3  False   False   True

In [85]:
df[df['gender'].isna()]

     name gender             email
0  Ankit1    NaN  ankit@gmail.com1

In [86]:
df.dropna()

     name gender             email
1  Ankit1  Male1  ankit@gmail.com1
2  Rahul1  Male1  rahul@gmail.com1

In [87]:
df.dropna(how="any") #any value null

     name gender             email
1  Ankit1  Male1  ankit@gmail.com1
2  Rahul1  Male1  rahul@gmail.com1

In [88]:
df.dropna(how="all") #all value null

     name   gender             email
0  Ankit1      NaN  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1               NaN

In [89]:
#check column vise null  with all
df.dropna(how="all", axis='columns')

     name   gender             email
0  Ankit1      NaN  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1               NaN

In [90]:
#check column vise null  with any
df.dropna(how="any", axis='columns')

     name
0  Ankit1
1  Ankit1
2  Rahul1
3  Priya1

In [91]:
df

     name   gender             email
0  Ankit1      NaN  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1               NaN

In [92]:
df.fillna('new') # all value replace

     name   gender             email
0  Ankit1      new  ankit@gmail.com1
1  Ankit1    Male1  ankit@gmail.com1
2  Rahul1    Male1  rahul@gmail.com1
3  Priya1  Female1               new

In [93]:
#specific column replace
df['gender'].fillna('Male')

0       Male
1      Male1
2      Male1
3    Female1
Name: gender, dtype: object